Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_282-Threefold_Training-v1.tmx
Source language: bo
Languages: en

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus have I heard at one time.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: དགེ་སློང་དག་འདི་དག་ནི་ཚུལ་ཁྲིམས་ཡིན་ནོ།
en: “This, bhikṣus, is discipline.

source: །འདི་ནི་ཏིང་ངེ་འཛིན་ཡིན་ནོ།
en: This is meditative concentration.

source: །འདི་ནི་ཤེས་རབ་ཡིན་ནོ།
en: This is wisdom.

source: །དགེ་སློང་དག་ཚུལ་ཁྲིམས་ལ་གོམས་པར་བྱས་ན། ཏིང་ངེ་འཛིན་ལ་ཡུན་རིང་དུ་གནས་པར་འགྱུར་རོ།
en: Bhikṣus, training in discipline will lead one to abide for a long time in meditative concentration.

source: །བསླབ་པ་གསུམ་གྱི་མདོ་རྫོགས་སོ།།
en: This completes the Sūtra on the Threefold Training.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། དགེ་སློང་དེ་དག་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: After the Bhagavān had thus spoken, the bhikṣus rejoiced and praised the Bhagavān’s words.

source: །འདི་ལས་སྲིད་པ་གཞན་མི་ཤེས་སོ་ཞེས་ཡང་དག་པ་ཁོ་ནར་ཤེས་པར་འགྱུར་རོ།
en: From here onward, I will not know any further existence.’ ”

source: གྲོང་སྤྱིལ་བུ་ཅན་གྱི་གྲོང་གི་བྱང་ཕྱོགས་ཀྱི་ཤིང་སཱ་ལའི་ཚལ་ན། དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: settled to the north of that village in a grove of sāl trees, with a great saṅgha of bhikṣus

source: བཅོམ་ལྡན་འདས་ཡུལ་སྤོང་བྱེད་ན། ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་དང་། གྲོང་སྤྱིལ་བུ་ཅན་དུ་བྱོན་ཏེ།
en: As the Bhagavān was wandering in the land of Vṛji, he arrived at the village of Kuṭigrāmaka and

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Thereupon the Bhagavān taught the following to the bhikṣus:

source: །ཏིང་ངེ་འཛིན་ལ་གོམས་པར་བྱས་ན། ཤེས་རབ་ཐོབ་པར་འགྱུར།
en: Training in meditative concentration will lead one to gain wisdom.

source: ཤེས་རབ་ལ་གོམས་པར་བྱས་ན།
en: By training in wisdom,

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དག་ལས་སེམས་ཡང་དག་པ་ཁོ་ནར་རྣམ་པར་གྲོལ་བར་འགྱུར་རོ།
en: one’s mind will be completely liberated from desire, anger, and ignorance.

source: །དེ་ལྟར་སེམས་ཡང་དག་པ་ཁོ་ནར་རྣམ་པར་གྲོལ་བའི་འཕགས་པའི་ཉན་ཐོས་ཀྱིས་ནི་བདག་གི་ཟག་པ་འདི་ཟད་དོ།
en: In this way, having a completely liberated mind, a noble śrāvaka will perfectly know: ‘My defilements have ceased.

source: །ཚངས་པར་སྤྱོད་པ་ནི་བསྟེན་ཏོ། །བྱ་བ་ནི་བྱས་སོ།
en: I have lived the sublime life. What was to be done has been done.
